print("Welcome to Treasure Island.")
print("Your mission is to find the treasure.")

choice_1 = input("Which way do you want to go? Left or Right (L/R): ").lower().strip()
choice_2 = input("You have reached a lake. Do you want to swim or wait? (swim/wait): ").lower().strip()
choice_3 = input("You arrive at the doors. Which door do you choose? Red, Yellow or Blue: ").lower().strip()


if choice_1 in ("l", "left"):
    if choice_2 in ("wait", "w"):
        if choice_3 in ("red",):
            print("Burned by fire 🔥... Game Over!!!")
        elif choice_3 in ("blue",):
            print("Eaten by beasts 🐉... Game Over!!!")
        elif choice_3 in ("yellow", "y"):
            print("Yayyy 🎉🪙 You found the treasure! YOU WIN!!!")
            print(r'''
            *******************************************************************************
                      |                   |                  |                     |
             _________|________________.=""_;=.______________|_____________________|_______
            |                   |  ,-"_,=""     `"=.|                  |
            |___________________|__"=._o`"-._        `"=.______________|___________________
                      |                `"=._o`"=._      _`"=._                     |
             _________|_____________________:=._o "=._."_.-="'"=.__________________|_______
            |                   |    __.--" , ; `"=._o." ,-"""-._ ".   |
            |___________________|_._"  ,. .` ` `` ,  `"-._"-._   ". '__|___________________
                      |           |o`"=._` , "` `; .". ,  "-._"-._; ;              |
             _________|___________| ;`-.o`"=._; ." ` '`."\ ` . "-._ /_______________|_______
            |                   | |o ;    `"-.o`"=._``  '` " ,__.--o;   |
            |___________________|_| ;     (#) `-.o `"=.`_.--"_o.-; ;___|___________________
            ____/______/______/___|o;._    "      `".o|o_.--"    ;o;____/______/______/____
            /______/______/______/_"=._o--._        ; | ;        ; ;/______/______/______/_
            ____/______/______/______/__"=._o--._   ;o|o;     _._;o;____/______/______/____
            /______/______/______/______/____"=._o._; | ;_.--"o.--"_/______/______/______/_
            ____/______/______/______/______/_____"=.o|o_.--""___/______/______/______/____
            /______/______/______/______/______/______/______/______/______/______/_____ /
            *******************************************************************************
            ''')

        else:
            print("That door doesn’t exist 🤷‍♀️... Game Over!!")
    else:
        print("Oh no!! The crocodiles got you 🐊... Game Over!!")
else:
    print("You fell into a hole 💀... Game Over!!")
